<?php
//--------------
// task 1
$x = 0;
if ($x >= 0) {
	if ($x == 0) {
		$y = 0;
	}
	else $y = 1;
}
else $y = -1;
echo "y = $y<br/><br/>";

//---------------
// task 2 - определение суммы максимального и минимального из трёх чисел

$a=2;
$b=2;
$c=2;

if ($a > $b) {
	if ($a > $c) {
		$max_num = $a;
		if ($b < $c) {
			$min_num = $b;
		}
		else $min_num = $c;
	}
	else {
		$max_num = $c;
		$min_num = $b;
	}
}
else {
	if ($b > $c) {
		$max_num = $b;
		if ($a > $c) {
			$min_num = $c;
		}
		else $min_num = $a;
	}
	else {
		$max_num = $c;
		$min_num = $a;
	}
}
$sum=$max_num+$min_num;
echo "ряд данных: $a, $b, $c<br/>";
echo "максимальное чиcло: $max_num<br/>";
echo "минимальное чиcло: $min_num<br/>";
echo "сумма: $sum<br/><br/>";

//---------------
// task 3 - определение максимального из четырех чисел

$a=8;
$b=8;
$c=8;
$d=7;

if ($a >= $b && $a >= $c && $a >= $d) {
	$max_num = $a;
}
if ($b >= $a && $b >= $c && $b >= $d) {
	$max_num = $b;
}
if ($c >= $a && $c >= $b && $c >= $d) {
	$max_num = $c;
}
if ($d >= $a && $d >= $b && $d >= $c) {
	$max_num = $d;
}
echo "ряд данных: $a, $b, $c, $d<br/>";
echo "максимальное чиcло: $max_num<br/><br/>";

//---------------
// task 4 - влезет ли товар в сумку

$a = 50; //длина сумки
$b = 40; //ширина сумки
$h = 20; //высота сумки
$c = 10; //длина товара
$d = 10; //ширина товара
$z = 10; //высота товара
echo "размер сумки: $a x $b x $h; размер товара: $c x $d x $z<br/>";
if (($a >= $c && $b >= $d && $h >= $z) || ($b >= $c && $a >= $d && $h >= $z) || ($h >= $c && $b >= $d && $a >= $z) || ($a >= $z && $b >= $c && $h >= $d) || ($a >= $c && $b >= $z && $h >= $d) || ($a >= $d && $b >= $z && $h >= $c)) {
	echo "товар в сумку влазит";
}
else echo "товар в сумку не влазит, как ни крути";
